backend/app/services/my_report_calculator.rb

  def user_report
    # Single query: group by status and count
    status_counts = tenant.requests
      .where(requester_id: user.id)
      .group(:status)
      .count

    {
      role: "user",
      total_requests: status_counts.values.sum,
      approved: status_counts["approved"] || 0,
      pending: status_counts["pending_approval"] || 0,
      rejected: status_counts["rejected"] || 0,
      submitted: status_counts["submitted"] || 0
---
SELECT COUNT(*) AS "count_all", "requests"."status" AS "requests_status" FROM "requests" WHERE "requests"."tenant_id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e' AND "requests"."requester_id" = '0b0d12a0-5028-4d30-ac12-93a5a472fd12' GROUP BY "requests"."status"
SELECT COUNT(*) AS "count_all", "requests"."status" AS "requests_status" FROM "requests" WHERE "requests"."tenant_id" = 'aa29ef8c-86bf-413d-9ea9-ed2c4360c3a5' AND "requests"."requester_id" = 'fe43d2ce-b8cd-4d8e-b6ed-2bd799945724' GROUP BY "requests"."status"

  def approver_report
    # Single query: group approvals by action
    approval_counts = Approval
      .where(approver_id: user.id, tenant_id: tenant.id)
      .group(:action)
      .count

    # Single query: pending inbox count
    pending_inbox = Request
      .where(status: "pending_approval")
      .joins(request_type: :request_type_approvers)
      .where(request_type_approvers: { user_id: user.id })
      .count

    # Single query: user's own requests grouped by status
    my_request_counts = tenant.requests
      .where(requester_id: user.id)
      .group(:status)
      .count

    {
      role: "approver",
      total_reviewed: approval_counts.values.sum,
      approved_by_me: approval_counts["approved"] || 0,
      rejected_by_me: approval_counts["rejected"] || 0,
      pending_inbox: pending_inbox,
      my_requests: {
        total: my_request_counts.values.sum,
        pending: my_request_counts["pending_approval"] || 0
---
SELECT COUNT(*) AS "count_all", "requests"."status" AS "requests_status" FROM "requests" WHERE "requests"."tenant_id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e' AND "requests"."requester_id" = '75f36521-1c51-417c-9a15-b928634bd7a5' GROUP BY "requests"."status"
SELECT COUNT(*) AS "count_all", "approvals"."action" AS "approvals_action" FROM "approvals" WHERE "approvals"."approver_id" = '37ec41c9-c494-4128-bb94-07c2b87ad9e6' AND "approvals"."tenant_id" = 'aa29ef8c-86bf-413d-9ea9-ed2c4360c3a5' GROUP BY "approvals"."action"
SELECT COUNT(*) FROM "requests" INNER JOIN "request_types" ON "request_types"."deleted_at" IS NULL AND "request_types"."id" = "requests"."request_type_id" INNER JOIN "request_type_approvers" ON "request_type_approvers"."request_type_id" = "request_types"."id" WHERE "requests"."status" = 'pending_approval' AND "request_type_approvers"."user_id" = '37ec41c9-c494-4128-bb94-07c2b87ad9e6'

  def admin_report
    # Reuse existing optimized queries
    status_counts = tenant.requests.group(:status).count

    # Additional aggregations for enhanced admin view
    type_status_counts = tenant.requests
      .joins(:request_type)
      .group("request_types.name", :status)
      .count

    approver_action_counts = Approval
      .where(tenant_id: tenant.id)
      .joins(:approver)
      .group("users.id", "users.name", :action)
      .count

    # Build comprehensive admin report
    {
      role: "admin",
      # Overall status breakdown (matches /admin/reports/summary)
      status_breakdown: {
        total: status_counts.values.sum,
        submitted: status_counts["submitted"] || 0,
        pending_approval: status_counts["pending_approval"] || 0,
        approved: status_counts["approved"] || 0,
        rejected: status_counts["rejected"] || 0
---
SELECT COUNT(*) AS "count_all", "requests"."status" AS "requests_status" FROM "requests" WHERE "requests"."tenant_id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e' GROUP BY "requests"."status"
SELECT COUNT(*) AS "count_all", "request_types"."name" AS "request_types_name", "requests"."status" AS "requests_status" FROM "requests" INNER JOIN "request_types" ON "request_types"."deleted_at" IS NULL AND "request_types"."id" = "requests"."request_type_id" WHERE "requests"."tenant_id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e' GROUP BY "request_types"."name", "requests"."status"
SELECT COUNT(*) AS "count_all", "request_types"."name" AS "request_types_name", "requests"."status" AS "requests_status" FROM "requests" INNER JOIN "request_types" ON "request_types"."deleted_at" IS NULL AND "request_types"."id" = "requests"."request_type_id" WHERE "requests"."tenant_id" = '0794ca8a-9c83-438b-9909-b2a7e8a07191' GROUP BY "request_types"."name", "requests"."status"
SELECT COUNT(*) FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."tenant_id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e'
SELECT COUNT(*) AS "count_all", "users"."id" AS "users_id", "users"."name" AS "users_name", "approvals"."action" AS "approvals_action" FROM "approvals" INNER JOIN "users" ON "users"."deleted_at" IS NULL AND "users"."id" = "approvals"."approver_id" WHERE "approvals"."tenant_id" = '0794ca8a-9c83-438b-9909-b2a7e8a07191' GROUP BY "users"."id", "users"."name", "approvals"."action"

      # Approver performance metrics
      approver_activity: build_approver_activity(approver_action_counts),
      # User counts
      total_users: tenant.users.count,
      total_approvers: tenant.users.where(role: "approver").count
---
SELECT COUNT(*) FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."tenant_id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e' AND "users"."role" = 'approver'

  def build_type_breakdown(type_status_counts)
    tenant.request_types.pluck(:name).map do |type_name|
---
SELECT "request_types"."name" FROM "request_types" WHERE "request_types"."deleted_at" IS NULL AND "request_types"."tenant_id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e'

  def build_approver_activity(approver_action_counts)
    tenant.users.where(role: "approver").pluck(:id, :name).map do |approver_id, approver_name|
---
SELECT "users"."id", "users"."name" FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."tenant_id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e' AND "users"."role" = 'approver'