backend/app/services/quota_calculator.rb

SELECT "rules".* FROM "rules" WHERE "rules"."deleted_at" IS NULL AND "rules"."tenant_id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e' AND "rules"."request_type_id" = 'bb1138cc-6295-4b40-a828-fe2e857d53c8' AND "rules"."grade" = 1 LIMIT 1
---
  def rule
    @rule ||= Rule.find_by!(
      tenant: @tenant,
      request_type: @request_type,
      grade: @user.grade
    )