backend/app/services/rule_evaluator.rb

SELECT "rules".* FROM "rules" WHERE "rules"."deleted_at" IS NULL AND "rules"."tenant_id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e' AND "rules"."request_type_id" = 'bb1138cc-6295-4b40-a828-fe2e857d53c8' AND "rules"."grade" = 1 LIMIT 1
UPDATE "requests" SET "status" = 'auto_approved', "updated_at" = '2026-02-09 06:39:09.752147' WHERE "requests"."id" = '5b9290e1-e055-4e9b-b9fc-be66fed9d239'
INSERT INTO "approvals" ("action", "approver_id", "created_at", "definition", "reason", "request_id", "rule_id", "tenant_id", "updated_at") VALUES ('approved', NULL, '2026-02-05 17:12:25.105363', 10000, 'Auto approved by the system as under the grade limit.', '2250d943-5e91-418f-bb33-a65d48294246', '4f5a2b27-f6dd-47a0-ba23-bb8b1c83d65f', 'aa29ef8c-86bf-413d-9ea9-ed2c4360c3a5', '2026-02-05 17:12:25.105363') RETURNING "id"
---
  def auto_approve!(quota)
    rule = Rule.find_by!(
      tenant: @tenant,
      request_type: @request_type,
      grade: @user.grade
    )
    @request.update!(status: "auto_approved")

    Approval.create!(
      tenant: @request.tenant,
      request: @request,
      approver: nil,
      rule: rule,
      definition: rule.definition,
      action: "approved",
      reason: "Auto approved by the system as under the grade limit."
    )

UPDATE "requests" SET "status" = 'pending_approval', "updated_at" = '2026-02-09 08:48:27.496772' WHERE "requests"."id" = '0bed74e3-7a8e-4787-990c-7c868a610ee7'
---
  def route_to_approver!
    @request.update!(status: "pending_approval")