backend/app/controllers/api/v1/approver/requests_controller.rb

SELECT "request_type_approvers".* FROM "request_type_approvers" WHERE "request_type_approvers"."request_type_id" IN ('9f083360-28a1-4237-8e11-78bcfd0c0ac2', 'bde900ab-b736-40c5-b171-0b2e0f2aafad')
SELECT "tenants".* FROM "tenants" WHERE "tenants"."deleted_at" IS NULL AND "tenants"."id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e' LIMIT 1
SELECT "request_types".* FROM "request_types" WHERE "request_types"."deleted_at" IS NULL AND "request_types"."id" IN ('dbc4ad97-8696-4a00-9423-3d4df65dbd59', '1f5dd956-b4d1-456e-a5ea-d3c63ebde7b8')
---
        def index
          # Admins see all pending requests, approvers see only their assigned requests
          requests = if current_user.role == "admin"
                       # Admins can approve any pending request
                       Request
                         .where(status: "pending_approval")
                         .where(tenant_id: current_user.tenant_id)
          else
                       # Approvers see only pending requests for their assigned request types
                       Request
                         .where(status: "pending_approval")
                         .joins(request_type: :request_type_approvers)
                         .where(request_type_approvers: { user_id: current_user.id })
          end

          requests = requests.includes(:request_type, :requester)

SELECT "requests".* FROM "requests" WHERE "requests"."id" = '98dec99d-ce2c-4268-97d7-ebc7d5a6b62d' LIMIT 1
UPDATE "requests" SET "status" = 'approved', "updated_at" = '2026-02-05 17:17:39.249752' WHERE "requests"."id" = '98dec99d-ce2c-4268-97d7-ebc7d5a6b62d'
INSERT INTO "approvals" ("action", "approver_id", "created_at", "definition", "reason", "request_id", "rule_id", "tenant_id", "updated_at") VALUES ('approved', 'a8b58455-32ed-4b42-af48-3bb969d2c5b8', '2026-02-05 17:17:39.262185', 50000, 'kharcha thoda kam karo bhai...', '98dec99d-ce2c-4268-97d7-ebc7d5a6b62d', '6d9b88af-a02d-4d3c-8099-8cb7fb3a2d4a', 'aa29ef8c-86bf-413d-9ea9-ed2c4360c3a5', '2026-02-05 17:17:39.262185') RETURNING "id"
---
        def update
          request = Request.find(params[:id])
          authorize! :update, request

          return render json: { error: "Self approval not allowed" },
                        status: :unprocessable_entity if
                        request.requester_id == current_user.id

          ActiveRecord::Base.transaction do
            request.update!(
              status: params[:action_type] == "approved" ? "approved" : "rejected"
            )

            Approval.create!(
              tenant: request.tenant,
              request: request,
              approver: current_user,
              rule: applicable_rule(request),
              definition: applicable_rule(request)&.definition,
              action: params[:action_type],
              reason: params[:reason]
            )

SELECT "tenants".* FROM "tenants" WHERE "tenants"."deleted_at" IS NULL AND "tenants"."id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e' LIMIT 1
SELECT "rules".* FROM "rules" WHERE "rules"."deleted_at" IS NULL AND "rules"."tenant_id" = 'aa29ef8c-86bf-413d-9ea9-ed2c4360c3a5' AND "rules"."request_type_id" = 'dbc4ad97-8696-4a00-9423-3d4df65dbd59' AND "rules"."grade" = 3 LIMIT 1
---
        def applicable_rule(request)
          Rule.find_by(
            tenant: request.tenant,
            request_type: request.request_type,
            grade: request.requester.grade
          )