backend/app/controllers/api/v1/requests_controller.rb

SELECT "approvals".* FROM "approvals" WHERE "approvals"."request_id" IN ('df8ae919-2032-46b7-9f7e-6458a9a635d5', '601aa644-d37d-4d6c-af3a-4b50803fde64', '8af5602c-e78b-4786-9e4e-4131a7fed677', '1f0b199c-d959-4616-b10d-916c3cfab803', 'aab4d455-2c63-42c7-8824-d49f4d9c447e', '46ee06c7-144e-4e91-a0d7-925264a30406', 'a51a490c-1c0a-4e24-b89c-6d4acecc4dde', 'b38a730d-00a7-4407-aa9d-cf94458b5cf7', 'af434a0f-1b1c-48de-839f-2c2ad60da375', '2766c10a-edae-458f-b00d-8ba5554ae5b0')
SELECT "request_types".* FROM "request_types" WHERE "request_types"."deleted_at" IS NULL AND "request_types"."id" IN ('dbc4ad97-8696-4a00-9423-3d4df65dbd59', '1f5dd956-b4d1-456e-a5ea-d3c63ebde7b8')
SELECT "tenants".* FROM "tenants" WHERE "tenants"."deleted_at" IS NULL AND "tenants"."id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e' LIMIT 1
SELECT "approvals".* FROM "approvals" WHERE "approvals"."request_id" IN ('2e13a21d-6be0-49cf-9e1c-f76a361d92f0', '86cacac7-4dfc-43a1-bca4-80b0c81b3067', '0bed74e3-7a8e-4787-990c-7c868a610ee7', 'c448386a-8722-4f4a-a138-436f96886bd1', '5b9290e1-e055-4e9b-b9fc-be66fed9d239', '1f0b199c-d959-4616-b10d-916c3cfab803', '8af5602c-e78b-4786-9e4e-4131a7fed677', '601aa644-d37d-4d6c-af3a-4b50803fde64', 'df8ae919-2032-46b7-9f7e-6458a9a635d5', 'aab4d455-2c63-42c7-8824-d49f4d9c447e')
SELECT "request_types".* FROM "request_types" WHERE "request_types"."deleted_at" IS NULL AND "request_types"."id" IN ('9f083360-28a1-4237-8e11-78bcfd0c0ac2', 'bde900ab-b736-40c5-b171-0b2e0f2aafad', 'bb1138cc-6295-4b40-a828-fe2e857d53c8')
---
      def index
        # Manual filtering based on role since we use block-based abilities
        requests = case current_user.role
        when "admin"
                     # Admins can see all requests in their tenant
                     current_user.tenant.requests
        when "approver"
                     # Approvers see pending requests for their assigned request types
                     Request
                       .where(status: "pending_approval")
                       .joins(request_type: :request_type_approvers)
                       .where(request_type_approvers: { user_id: current_user.id })
        else
                     # Users see only their own requests
                     current_user.tenant.requests.where(requester_id: current_user.id)
        end

        requests = requests.includes(:requester, :request_type)

        render json: requests.map { |req| serialize_request(req) }

INSERT INTO "requests" ("created_at", "request_type_id", "requested_value", "requester_id", "status", "tenant_id", "updated_at") VALUES ('2026-02-05 17:12:25.082440', 'dbc4ad97-8696-4a00-9423-3d4df65dbd59', 2000, 'fe43d2ce-b8cd-4d8e-b6ed-2bd799945724', 'submitted', 'aa29ef8c-86bf-413d-9ea9-ed2c4360c3a5', '2026-02-05 17:12:25.082440') RETURNING "id"
---
      def create
        authorize! :create, Request

        request = Request.new(
          tenant: current_user.tenant,
          request_type_id: params[:request_type_id],
          requester: current_user,
          requested_value: params[:requested_value],
          status: "submitted"
        )

        ActiveRecord::Base.transaction do
          request.save!