backend/app/controllers/api/v1/request_types_controller.rb

SELECT "tenants".* FROM "tenants" WHERE "tenants"."deleted_at" IS NULL AND "tenants"."id" = 'aa29ef8c-86bf-413d-9ea9-ed2c4360c3a5' LIMIT 1
---
      def index
        authorize! :read, RequestType
        request_types = current_user.tenant.request_types.includes(:approvers)

SELECT "request_types".* FROM "request_types" WHERE "request_types"."deleted_at" IS NULL AND "request_types"."tenant_id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e' AND "request_types"."name" = 'leave' LIMIT 1
---
      def create
        authorize! :create, RequestType

        existing = current_user.tenant.request_types.find_by(name: params[:name])

INSERT INTO "request_types" ("created_at", "deleted_at", "name", "tenant_id", "updated_at") VALUES ('2026-02-05 17:00:53.542854', NULL, 'expense', 'aa29ef8c-86bf-413d-9ea9-ed2c4360c3a5', '2026-02-05 17:00:53.542854') RETURNING "id"
INSERT INTO "request_type_approvers" ("request_type_id", "user_id", "created_at", "updated_at") VALUES ('bb1138cc-6295-4b40-a828-fe2e857d53c8', '75f36521-1c51-417c-9a15-b928634bd7a5', '2026-02-09 06:36:38.302760', '2026-02-09 06:36:38.302760') RETURNING "id"
---
        )

        ActiveRecord::Base.transaction do
          request_type.save!

          approvers.each do |user|
            RequestTypeApprover.create!(
              request_type: request_type,
              user: user
            )

SELECT "request_types".* FROM "request_types" WHERE "request_types"."deleted_at" IS NULL AND "request_types"."tenant_id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e' AND "request_types"."id" = 'ac8ae25c-6c03-4f9b-ab7b-69ab2f188711' LIMIT 1
SELECT "tenants".* FROM "tenants" WHERE "tenants"."deleted_at" IS NULL AND "tenants"."id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e' LIMIT 1
---
      def destroy
        request_type = current_user.tenant.request_types.find(params[:id])