backend/app/controllers/api/v1/rules_controller.rb

      def index
        authorize! :read, Rule
        rules = current_user.tenant.rules.includes(:request_type)
---
SELECT "tenants".* FROM "tenants" WHERE "tenants"."deleted_at" IS NULL AND "tenants"."id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e' LIMIT 1

      def create
        authorize! :create, Rule
        request_type = current_user.tenant.request_types.find(params[:request_type_id])

        rule = Rule.new(
          tenant: current_user.tenant,
          request_type: request_type,
          grade: params[:grade],
          definition: params[:definition]
        )

        if rule.save
---
SELECT "request_types".* FROM "request_types" WHERE "request_types"."deleted_at" IS NULL AND "request_types"."tenant_id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e' AND "request_types"."id" = 'bb1138cc-6295-4b40-a828-fe2e857d53c8' LIMIT 1
SELECT "tenants".* FROM "tenants" WHERE "tenants"."deleted_at" IS NULL AND "tenants"."id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e' LIMIT 1
INSERT INTO "rules" ("created_at", "definition", "deleted_at", "grade", "request_type_id", "tenant_id", "updated_at") VALUES ('2026-02-05 17:03:27.871104', 10000, NULL, 1, 'dbc4ad97-8696-4a00-9423-3d4df65dbd59', 'aa29ef8c-86bf-413d-9ea9-ed2c4360c3a5', '2026-02-05 17:03:27.871104') RETURNING "id"

      def destroy
        rule = current_user.tenant.rules.find(params[:id])
---
SELECT "rules".* FROM "rules" WHERE "rules"."deleted_at" IS NULL AND "rules"."tenant_id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e' AND "rules"."id" = '542b646f-f3a2-4398-863c-722d828a5a33' LIMIT 1
SELECT "tenants".* FROM "tenants" WHERE "tenants"."deleted_at" IS NULL AND "tenants"."id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e' LIMIT 1