backend/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("created_at", "deleted_at", "email", "grade", "name", "password_digest", "role", "tenant_id", "updated_at") VALUES ('2026-02-05 16:56:47.485822', NULL, 'ishaan@example.com', 3, 'Ishaan Bhela', '$2a$12$z5hhjkzkN/Zi10.Y/mLZ0ebjSAFUUZhHA2mTjQQVAob1WzRWyJCKC', 'approver', 'aa29ef8c-86bf-413d-9ea9-ed2c4360c3a5', '2026-02-05 16:56:47.485822') RETURNING "id"
---
      def create
        authorize! :create, User

        user = User.new(user_params)
        user.tenant = current_user.tenant

        if user.save

SELECT "tenants".* FROM "tenants" WHERE "tenants"."deleted_at" IS NULL AND "tenants"."id" = '0794ca8a-9c83-438b-9909-b2a7e8a07191' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."tenant_id" = '0794ca8a-9c83-438b-9909-b2a7e8a07191' AND "users"."id" = '658e8d0c-fa2f-428e-b58e-4c73d136e919' LIMIT 1
---
      def destroy
        user = current_user.tenant.users.find(params[:id])