app/controllers/concerns/authenticatable.rb

SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = 'a8b58455-32ed-4b42-af48-3bb969d2c5b8' LIMIT 1
---
  def authenticate_user
    header = request.headers["Authorization"]
    token = header.split(" ").last if header

    if token
      decoded = decode_token(token)
      @current_user = User.find_by(id: decoded["sub"])