backend/app/controllers/api/v1/admin/reports_controller.rb

SELECT COUNT(*) FROM "requests" WHERE "requests"."tenant_id" = 'aa29ef8c-86bf-413d-9ea9-ed2c4360c3a5'
---
        def total_requests(tenant)
          tenant.requests.count

SELECT COUNT(*) AS "count_all", "requests"."status" AS "requests_status" FROM "requests" WHERE "requests"."tenant_id" = 'aa29ef8c-86bf-413d-9ea9-ed2c4360c3a5' GROUP BY "requests"."status"
---
        def status_breakdown(tenant)
          tenant.requests.group(:status).count

SELECT COUNT(*) AS "count_all", "request_types"."name" AS "request_types_name" FROM "requests" INNER JOIN "request_types" ON "request_types"."deleted_at" IS NULL AND "request_types"."id" = "requests"."request_type_id" WHERE "requests"."tenant_id" = 'aa29ef8c-86bf-413d-9ea9-ed2c4360c3a5' GROUP BY "request_types"."name"
---
        def request_type_breakdown(tenant)
          tenant.requests
                .joins(:request_type)
                .group("request_types.name")
                .count

SELECT COUNT(*) AS "count_all", "approvals"."action" AS "approvals_action" FROM "approvals" WHERE "approvals"."tenant_id" = 'aa29ef8c-86bf-413d-9ea9-ed2c4360c3a5' GROUP BY "approvals"."action"
---
        def decision_breakdown(tenant)
          tenant.approvals.group(:action).count

SELECT COUNT(*) FROM "rules" WHERE "rules"."deleted_at" IS NULL AND "rules"."tenant_id" = 'd03f07e3-fd7e-43e4-ab08-99ea120abb0e'
---
        def total_rules(tenant)
          tenant.rules.count