backend/app/controllers/api/v1/admin/reports_controller.rb

SELECT COUNT(*) AS "count_all", "approvals"."rule_id" AS "approvals_rule_id" FROM "approvals" WHERE "approvals"."tenant_id" = 'aa29ef8c-86bf-413d-9ea9-ed2c4360c3a5' AND "approvals"."rule_id" IS NOT NULL GROUP BY "approvals"."rule_id"
---
        def rule_hit_counts(tenant)
          tenant.approvals
                .where.not(rule_id: nil)
                .group(:rule_id)
                .count